/*
 * 『明解Java入門編』柴田望洋
 *
 * 問題:演習10-3 p353
 * 	二値/三値/配列の
 * 	最小値を求めるメソッドや最大値を求めるメソッドを集めた
 * 	ユーティリティクラスMinMaxを作成せよ。
 *
 * パッケージ名:ensyu10_03
 * クラス名:MinMax
 * 作成日:2022/03/18
 * 作成者:ShidaKazuna
 * 修正日:
 * 修正者:
 * ver:1.0.0
 *
 */


package ensyu10_03;

/***************************************ユーティリティクラス***************************************
 * クラス名：MinMax
 *	二値/三値/配列の最小値を求めるメソッドや最大値を求める
 */
public class MinMax {

	//------------------二つのint型整数a,bの最小値を求めるメソッド--------------------//
	/*メソッド名：min※多重定義
	 */
	public static int min(int a, int b) {
		//aとbで小さい方を返却値とする
		return a < b ? a : b;
	}
	//--------------------------------------------------------------------------------//

	//------------------三つのint型整数a,b,cの最小値を求めるメソッド------------------//
	/*メソッド名：min※多重定義
	 */
	public static int min(int a, int b, int c) {
		//比較用に変数を用意し、初期値aを設定
		int min = a;
		//minが比較対象より大きい場合、比較対象をminに入れなおす
		if (min > b) min = b;
		if (min > c) min = c;
		//返却値は比較し終わったmin
		return min;
	}
	//--------------------------------------------------------------------------------//

	//-----------------------配列aの要素の最小値を求めるメソッド----------------------//
	/*メソッド名：min※多重定義
	 */
	public static int min(int[] a) {
		//比較用に変数を用意し、初期値a[0]を設定
		int min = a[0];
		//インデックスの小さい要素から順に比較していく
		for (int idxItr = 1; idxItr < a.length; idxItr++) {
			//もしminより比較対象の方が小さかったらminを比較対象に置き換える
			if (min > a[idxItr]) {
				min = a[idxItr];
			}
		}
		//返却値は比較し終わったmin
		return min;
	}
	//--------------------------------------------------------------------------------//


	//------------------二つのint型整数a,bの最大値を求めるメソッド--------------------//
	/*メソッド名：max※多重定義
	 */
	public static int max(int a, int b) {
		//aとbで大きい方を返却値とする
		return a > b ? a : b;
	}
	//--------------------------------------------------------------------------------//

	//------------------三つのint型整数a,b,cの最大値を求めるメソッド------------------//
	/*メソッド名：max※多重定義
	 */
	public static int max(int a, int b, int c) {
		//比較用に変数を用意し、初期値aを設定
		int max = a;
		//maxが比較対象より大きい場合、比較対象をmaxに入れなおす
		if (max < b) max = b;
		if (max < c) max = c;
		//返却値は比較し終わったmax
		return max;
	}
	//--------------------------------------------------------------------------------//

	//-----------------------配列aの要素の最大値を求めるメソッド----------------------//
	/*メソッド名：max※多重定義
	 */
	public static int max(int[] a) {
		//比較用に変数を用意し、初期値a[0]を設定
		int max = a[0];
		//インデックスの小さい要素から順に比較していく
		for (int idxItr = 1; idxItr < a.length; idxItr++) {
			//もしmaxより比較対象の方が小さかったらmaxを比較対象に置き換える
			if (max < a[idxItr]) {
				max = a[idxItr];
			}
		}
		//返却値は比較し終わったmax
		return max;
	}
	//--------------------------------------------------------------------------------//

}
