/*
 * 『明解Java入門編』柴田望洋
 *
 * 問題:演習7-9 p235
 * 	「正の整数値：」と表示して
 * 	キーボードから正の整数値を読み込んで、
 * 	その値を返却するメソッドreadPlusIntを作成せよ。
 * 	0や負の値が入力されたら再入力させること。
 *
 * パッケージ名:ensyu07_09
 * クラス名:Ensyu07_09
 * 作成日:2022/03/03
 * 作成者:ShidaKazuna
 * 修正日:
 * 修正者:
 * ver:1.0.0
 *
 */


package ensyu07_09;

//キーボードからの入力値取得準備するためimport
import java.util.Scanner;

/***************************************クラス内容***************************************/
public class Ensyu07_09 {

	//------------Scannerメソッド(stdInにキーボードからの入力値を初期設定)------------//
	static Scanner stdIn = new Scanner (System.in);

	//--------------------正の整数値を入力してもらうメソッド--------------------//
	/*メソッド名：readPlusInt
	 *	「正の整数値：」と表示して、キーボードから正の整数値を読み込む
	 *	返却値は読み込んだ整数値の値
	 *	0や負の値が入力されたら再入力させる
	 */
	static int readPlusInt() {
		System.out.println("");
		int n;
		do {
			System.out.print("正の整数値：");
			n = stdIn.nextInt();
		} while (n <= 0);
		return n;
	}
	//---------------------------------------------------------------------------//

	//-------------------------続行の確認を行うメソッド-------------------------//
	/*メソッド名：confirmRetry
	 *	入力値が1のとき繰り返す、0のとき終了
	 */
	static boolean confirmRetry() {
		int retryNum;
		do {
			System.out.print("もう一度？ YES・・・1/NO・・・0：");
			retryNum = stdIn.nextInt();
		} while (retryNum < 0 || retryNum > 1);
		return retryNum == 1;
	}
	//--------------------------------------------------------------------------//

	//----------------------------------mainメソッド----------------------------------//
	public static void main(String[] args) {
		//プログラム開始メッセージ
		System.out.println("readPlusIntの返却値を表示します。");

		do {
			System.out.println("\t返却値：" + readPlusInt());
		} while (confirmRetry());

	}
	//--------------------------------------------------------------------------------//

}
/**************************************************************************************/
